package Day8;

public class Ex8 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
		//객체지향언어 230p
		/*
		 *객체지향언어
		 *=>기본적으로 순서를 지킴 
		 *=> 객체에 초점을 맞춤
		 *=>복사를 하고싶다 =>복사기설계도(클래스)를 이용해서 복사기(객체)를 만들고 
		 *               복사기능(메소드)을 이용하여 복사해라
		 *절차지향언어
		 *=>순서에 초점을 맞춤
		 *=> 복사를 하고싶다 =>복사하는 메소드를 만들어서 사용해라
		 * */


		/*클래스*/
		
		/*최종정리
		재귀메소드
		자기자신을 호출하는 메소드 
		java.lang.stackOverflowError 가 발생하면 재귀호출을 의심해라
		
		오버로딩
		한 클래스 안에서 메소드명이 동일한 메소드가 여러개일 경우
		조건1 매개변수의 갯수가 다른경우
		조건2 매개변수의 갯수가 같지만 자료형이 다른 경우
		
		클래스= 멤버변수+ 멤버메소드
		접근제한자 public , default, private, protected (상속)
		
		클래스=설계도
		객체 =제품
		클래스 객체명 = new 클래스();
		객체명.멤버변수 
		객체명.멤버메소드
		
		
		
		
		일반적으로(주로) 멤버변수는 private으로 설정
		멤버메소드는 public으로 설정
		*/

	}

}
