package Day7;

public class Ex9 {

	public static void main(String[] args) {
		//메소드 : 하나의 특정 기능하도록 작성된 코드,정해진 약속대로 입력
		
		/*
		 * (매개변수)입력-기능을실행시키기위한정보
		 *            단 자동형변환이가능한경우는 융통성을 발휘한다. 
		 *        => 매개변수를 잘 정해야한다.
		 *        => 매개변수는 최소한으로 
		 *    리턴타입-기능이 종료되고 알려주는 정보 
		 *          - 기능을 상세히 썼을때 알려준다,전달한다,등등의단어가 나오면 리턴타입이 필요하다.
		 *          그게 아니고 동작을 하고 부연설명이 없으면 리턴 타입이 필요없다 
		 *    메소드의특징
		 *    1. 재사용이 용이하고 
		 *    2 코드의 중복을 줄이고
		 *    3 프로그램의 구조화 
		 *    
		 *		                       		                           
		 * 
		 * 
		 * */

	}

}
